{
  "_name_or_path": "facebook/dinov3-vitl16-pretrain-lvd1689m",
  "add_cross_attention": false,
  "architectures": [
    "DINOv3ViTModel"
  ],
  "attention_dropout": 0.0,
  "bad_words_ids": null,
  "begin_suppress_tokens": null,
  "bos_token_id": null,
  "chunk_size_feed_forward": 0,
  "cross_attention_hidden_size": null,
  "decoder_start_token_id": null,
  "diversity_penalty": 0.0,
  "do_sample": false,
  "drop_path_rate": 0.0,
  "dtype": "float32",
  "early_stopping": false,
  "encoder_no_repeat_ngram_size": 0,
  "eos_token_id": null,
  "exponential_decay_length_penalty": null,
  "finetuning_task": null,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_size": 1024,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "is_decoder": false,
  "is_encoder_decoder": false,
  "key_bias": false,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "layer_norm_eps": 1e-05,
  "layerscale_value": 1.0,
  "length_penalty": 1.0,
  "max_length": 20,
  "min_length": 0,
  "mlp_bias": true,
  "model_type": "dinov3_vit",
  "no_repeat_ngram_size": 0,
  "num_attention_heads": 16,
  "num_beam_groups": 1,
  "num_beams": 1,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "num_register_tokens": 4,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "output_scores": false,
  "pad_token_id": null,
  "patch_size": 16,
  "pos_embed_jitter": null,
  "pos_embed_rescale": 2.0,
  "pos_embed_shift": null,
  "prefix": null,
  "problem_type": null,
  "proj_bias": true,
  "pruned_heads": {},
  "query_bias": true,
  "remove_invalid_values": false,
  "repetition_penalty": 1.0,
  "return_dict": true,
  "return_dict_in_generate": false,
  "rope_theta": 100.0,
  "sep_token_id": null,
  "suppress_tokens": null,
  "task_specific_params": null,
  "temperature": 1.0,
  "tf_legacy_loss": false,
  "tie_encoder_decoder": false,
  "tie_word_embeddings": true,
  "tokenizer_class": null,
  "top_k": 50,
  "top_p": 1.0,
  "torchscript": false,
  "transformers_version": "4.57.6",
  "typical_p": 1.0,
  "use_bfloat16": false,
  "use_gated_mlp": false,
  "value_bias": true
}